{
  "unit_name": "Los Basicos",
  "unit_description": "",
  "lessons": [
    {
      "title": "Hola Mundo",
      "content": "  El **JavaScript** es un lenguaje de programación que se utiliza para crear sitios web dinámicos y inetractivos.\n  En esta primera lección, vamos a aprender como escribir algo en la terminal.Primero voy definer que es una terminal. **La terminal** es una interfaz de texto que permite interactuar con el sistema operativo de una computadora mediante comandos escritos. En estas lecciónes, la terminal solo va monstrar los resultados de tu codigo.\n   Un **comando** es una instrucción dada a una computadora para que realice una acción específica. Cada comando tiene que terminar con un punto y coma (***;***). Los comandos se tienen que escribir exactamente como se ven. Esto quiere decir, si pones un mayúscula o minuscula incorrecta el comando no va trabajar.\n  Para escribir en la terminal, se usa el comando `console.log()`. Lo que se escribe en los paréntesis se graba en la terminal. Puedes poner variables como numeros, texto, y otras en los paréntesis. Por ejemplo si pongo `console.log(1);` , el numero 1 se graba en la terminal.\n  Para grabar texto, tienes que escribirlo entre dos comillas (*\"lo que quieres decir va aqui\"*). Por ejemplo `console.log(\"Buenos dias\");`, graba '*Buenos dias*' en la terminal.\n  Recuerdate que el comando se tiene que escribir exactamente como es. Si escribo `console.log()`, el comando no va trabajar porque la computadora no va reconocer la mayúscula.\n <span class=\"note\"> **Practica:** Usa este comando para grabar 'Hola Mundo' en la terminal.</span>",
      "starting_code": "// Codigo aqui...",
      "expected_result": "Hola Mundo"
    },
    {
      "title": "Las Variables",
      "content": "  Las Variables son bien importante. Una **variable** es como una caja donde se puede guardar información.\n  Para accessar una variable, se le tiene que dar un nombre. Hay una serie de reglas para darle un nombre a los variables: 1) El nombre tiene que empezar con una letra, un _, o un $. 2) El nombre no puede contener espacios. 3) No se puede usar palabras reservadas. 4) Se usa camelCase para formar el nombre.\n   <span class='note'>**Importante:** Las mayúsculas y menusculas no se consideran como la misma letras. Entonces los nombres `console` y `Console` no se consideran como el mismo nombre. El primer nombre (`console`) va ser reconocido como una parabra reservada per sel segundo nombre no.</span>\n   Que es una **palabra reservada**? Una palabra reservada es una palabra especial el lenguaje (como JavaScript) ya tiene guardada para darle un significado propio. No se puede usar como un nombre porque la computadora ya sabe que sirve para otra cosa. Por ejemplo, una variable no se puede llamar `console` porque es una palabra reservada.\n   Que es **camelCase**. camelCase (estiloCamello) es s una forma de escribir nombres de variables o funciones donde la primera palabra empieza con minúscula. Cada palabra siguiente empieza con mayúscula y sin espacios. Es una manera de crear nombres sin tener que usar epacios o guiones.\n   En JavaScript, el comando `let` se usa para crear una variable nueva. Por ejemplo, el comando `let x = 5;` hace una variable que se llama '`x`'. La variable '`x`' contiene el numero 5. Si lo emprimo en la terminal usando `console.log(x);`, entonces la terminal emprime 5.\n   <span class='note'>**Recuerda!** La mayúscula y menusucla no se condideran como la misma letra. Si intento `console.log(X)` (usando la `x` mayúscula), la computadora no va saber lo que quiero emprimir.</span> <span class='note'>**Practica:** haga una variable que contiene el numer '10' y emprimerlo usando `console.log()`</span>",
      "starting_code": "// Codigo aqui...",
      "expected_result": "10"
    },
    {
      "title": "Los Tipos de Variables",
      "content": "  Hay diferente tipos de variables. Los 3 mas comunes que vas usar se llaman \nLos 3 más comunes que vas a usar son:\n\n1. **Boolean** – Representa verdadero o falso (`true` / `false`).\n2. **Número** – Representa valores numéricos (`1`, `3.14`, `-7`).\n3. **String** – Representa texto, encerrado entre comillas (`\"Hola\"`, `'Mundo'`).\n\n Hay mas que tres varaibles, pero estos son los tres en que nos vamos enfocar por ahora.\n  Un **Boolean** es una variable que solo tiene dos valores, `true` (verdad) o `false` (falso). Se puede inicializar usando una de sus dos valores. Por ejemplo, `let x = true;` y `let y = false;` En estos ejemplos, la variable `x` es un boolean que tiene el valor `true` y la varaible `y` es un boolean que tiene el valor `false`.\n   Un **numero** es un tipo de varialbe que solo contiene numeros. Los numeros pueden ser decimales o enetero. Una variable que contiene numeros se puede inicializar usando un numero. Por ejemplo, `let numero = 2.5;`, En este ejemplo, la variable `numero` contiene `2.5`.\n  Un **String** es una variable que puede contener letras, numeros, espacios, y cáracters especiales. Todo que quieres poner dentro de un String se tiene poner dentro de dos comillos (**\"**). Por ejemplo, `let oracionEjemplo = \"Hola, como estas?\";` En este ejemplo, la variable `oracionEjemplo` contiene un String que contiene la oracion `Hola, como estas?`\n  <span class='note'>**Practica:** Haga un boolen que contiene el valor `true`, un numero que contiene el numero `11`, y un String que contiene la oracion `Buenos dias`. Despues emprimelo en la terminar usando un `console.log()` para cada variable.</span>",
      "starting_code": "// Codigo aqui...\n",
      "expected_result": "true\n11\nBuenos dias"
    }
  ]
}
